package main

import "fmt"

/*
切片做函数参数是引用传递，不会把整个底层数组拷贝，只是把某个元素传递到函数，
通过地址到传递到方式操作，函数内部切片改了，会影响到外面到实参
*/

func main() {
	// 切片1
	a := []int{0, 1, 2, 3, 4, 5, 6, 7, 8, 9}
	// 切片2
	s1 := a[2:5]          // 从a[2]开始取5-2=3个元素
	fmt.Println("s1", s1) // s1 [2 3 4]
	s1[1] = 666
	fmt.Println("s1", s1) //s1 [2 666 4]
	fmt.Println("a", a)   // a [0 1 2 666 4 5 6 7 8 9]
	// 切片3
	s2 := s1[2:7]         // 从s1的第二个元素开始取7-2=5个元素
	fmt.Println("s2", s2) // s2 [4 5 6 7 8]
	s2[2] = 777
	fmt.Println("s2", s2) // s2 [4 5 777 7 8]
	fmt.Println("a", a)   // a [0 1 2 666 4 5 777 7 8 9]

}
